In [1]:
import pandas as pd

## How to clean and structure data using Pandas
1. Handling null values
2. Deduplication of values
3. Handle Missing values
4. isnull()/isna()
5. isnull().sum()
6. dropna()
7. fillna(value)
8. ffill()
9. bfill()

In [25]:
#Handle Missing values
df = pd.read_csv("raw_data.csv")
df

    id         name   age country   gender
0    1      JohnDoe  29.0     USA     Male
1    1      JohnDoe  29.0     USA     Male
2    2    JaneSmith   NaN  Canada   Female
3    3         Alex   NaN     USA  Unknown
4    4  MariaGarcia  34.0   Spain   Female
5    5        LiWei  27.0   China     Male
6    6          NaN  45.0   India   Female
7    7    AhmedKhan  38.0     NaN     Male
8    8    RachelLee  29.0     USA   Female
9    9   CarolsRuiz   NaN  Mexico     Male
10  10   EmilyDavis  31.0     USA   Female

In [26]:
df.isnull()

       id   name    age  country  gender
0   False  False  False    False   False
1   False  False  False    False   False
2   False  False   True    False   False
3   False  False   True    False   False
4   False  False  False    False   False
5   False  False  False    False   False
6   False   True  False    False   False
7   False  False  False     True   False
8   False  False  False    False   False
9   False  False   True    False   False
10  False  False  False    False   False

In [27]:
df.isna()

       id   name    age  country  gender
0   False  False  False    False   False
1   False  False  False    False   False
2   False  False   True    False   False
3   False  False   True    False   False
4   False  False  False    False   False
5   False  False  False    False   False
6   False   True  False    False   False
7   False  False  False     True   False
8   False  False  False    False   False
9   False  False   True    False   False
10  False  False  False    False   False

In [28]:
df.isnull().sum()#count the number of missing values per coulmn

id         0
name       1
age        3
country    1
gender     0
dtype: int64

In [29]:
df.dropna() #Drops a given row

    id         name   age country  gender
0    1      JohnDoe  29.0     USA    Male
1    1      JohnDoe  29.0     USA    Male
4    4  MariaGarcia  34.0   Spain  Female
5    5        LiWei  27.0   China    Male
8    8    RachelLee  29.0     USA  Female
10  10   EmilyDavis  31.0     USA  Female

In [30]:
df.dropna(axis=1)

    id   gender
0    1     Male
1    1     Male
2    2   Female
3    3  Unknown
4    4   Female
5    5     Male
6    6   Female
7    7     Male
8    8   Female
9    9     Male
10  10   Female

In [31]:
df.fillna(0)

    id         name   age country   gender
0    1      JohnDoe  29.0     USA     Male
1    1      JohnDoe  29.0     USA     Male
2    2    JaneSmith   0.0  Canada   Female
3    3         Alex   0.0     USA  Unknown
4    4  MariaGarcia  34.0   Spain   Female
5    5        LiWei  27.0   China     Male
6    6            0  45.0   India   Female
7    7    AhmedKhan  38.0       0     Male
8    8    RachelLee  29.0     USA   Female
9    9   CarolsRuiz   0.0  Mexico     Male
10  10   EmilyDavis  31.0     USA   Female

In [32]:
#There are missing values in age, so instead of making it as 0, calculate the avg age and replace it
age_mean = df["age"].mean()
df["age"].fillna(age_mean)

0     29.00
1     29.00
2     32.75
3     32.75
4     34.00
5     27.00
6     45.00
7     38.00
8     29.00
9     32.75
10    31.00
Name: age, dtype: float64

In [35]:
cleaned_data = df.copy()
cleaned_data["age"]=cleaned_data["age"].fillna(age_mean)

In [36]:
cleaned_data

    id         name    age country   gender
0    1      JohnDoe  29.00     USA     Male
1    1      JohnDoe  29.00     USA     Male
2    2    JaneSmith  32.75  Canada   Female
3    3         Alex  32.75     USA  Unknown
4    4  MariaGarcia  34.00   Spain   Female
5    5        LiWei  27.00   China     Male
6    6          NaN  45.00   India   Female
7    7    AhmedKhan  38.00     NaN     Male
8    8    RachelLee  29.00     USA   Female
9    9   CarolsRuiz  32.75  Mexico     Male
10  10   EmilyDavis  31.00     USA   Female

In [37]:
#Forward fill, if a cell is empty, the value before it(previous cell value) will be filled in it
df.ffill()

    id         name   age country   gender
0    1      JohnDoe  29.0     USA     Male
1    1      JohnDoe  29.0     USA     Male
2    2    JaneSmith  29.0  Canada   Female
3    3         Alex  29.0     USA  Unknown
4    4  MariaGarcia  34.0   Spain   Female
5    5        LiWei  27.0   China     Male
6    6        LiWei  45.0   India   Female
7    7    AhmedKhan  38.0   India     Male
8    8    RachelLee  29.0     USA   Female
9    9   CarolsRuiz  29.0  Mexico     Male
10  10   EmilyDavis  31.0     USA   Female

In [ ]:
df.bfill() #The iteration is done from backwards

    id         name   age country   gender
0    1      JohnDoe  29.0     USA     Male
1    1      JohnDoe  29.0     USA     Male
2    2    JaneSmith  34.0  Canada   Female
3    3         Alex  34.0     USA  Unknown
4    4  MariaGarcia  34.0   Spain   Female
5    5        LiWei  27.0   China     Male
6    6    AhmedKhan  45.0   India   Female
7    7    AhmedKhan  38.0     USA     Male
8    8    RachelLee  29.0     USA   Female
9    9   CarolsRuiz  31.0  Mexico     Male
10  10   EmilyDavis  31.0     USA   Female